Lecture_7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-04 Wed 10:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Further examples of regressions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Ballesteros Chávez." />
</head>
<body>
<div id="content">
<h1 class="title">Further examples of regressions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org37140c5">The explicit calculation of the AIC</a></li>
<li><a href="#org39e87ce">Forcing the intercept</a></li>
<li><a href="#orgf74e41c">Polynomial Regressions</a></li>
<li><a href="#orgd069406">Using ANOVA to choose the best fitted model.</a></li>
<li><a href="#orgc2e1a5f">Logarithmic Regressions</a></li>
<li><a href="#orgd4e40c9">Power model</a></li>
<li><a href="#org3a70214">Multilinear Example</a></li>
</ul>
</div>
</div>


<div id="outline-container-org37140c5" class="outline-2">
<h2 id="org37140c5">The explicit calculation of the AIC</h2>
<div class="outline-text-2" id="text-org37140c5">
<p>
The Akaike information criterion (AIC) is an estimator of prediction
error of statistical models for a given data set.
</p>

<p>
AIC estimates the relative amount of information lost by a given
model: the less information a model loses, the higher the quality of
that model.
</p>

<p>
Given 2 models with \(AIC_1\) and \(AIC_2\), define \(AIC_{min}\) to be the minimum between
\(AIC_1\) and \(AIC_2\). Then the quantity:
</p>
\begin{equation}
\exp\left( \frac{AIC_{min} - AIC_{j}}{2}\right),
\end{equation}

<p>
can be interpreted as being proportional to the probability that the
 model "j" minimizes the (estimated) information loss.
</p>

<div class="org-src-container">
<pre class="src src-R">df <span style="color: #0288D1;">&lt;-</span> data.frame(
<span style="color: #6C3082;">"Year"</span> = c(
2000, 2001, 2002, 2003, 2004, 2005,
2006, 2007, 2008, 2009, 2010, 2011,
2012, 2013, 2014, 2015, 2016, 2017,
2018, 2019, 2020),
<span style="color: #6C3082;">"Expenditure"</span> = c(
125, 127, 118, 119, 135, 146,
155, 175, 202, 238, 270, 303,
372, 375, 420, 470, 467, 536,
668, 789, 845),
<span style="color: #6C3082;">"PatentsApp"</span> = c(
2404, 2202, 2313, 2268, 2381, 2028,
2157, 2392, 2488, 2883, 3203, 3880,
4415, 4237, 3939, 4676, 4261, 3942,
4207, 3887, 4010))

myfit  <span style="color: #0288D1;">&lt;-</span> lm(PatentsApp ~ Expenditure, data= df)

<span style="color: #795548;">## </span><span style="color: #795548;">note that we can write</span>


mu <span style="color: #0288D1;">&lt;-</span> myfit$fitted.values
NN <span style="color: #0288D1;">&lt;-</span> length(df$PatentsApp)
rss <span style="color: #0288D1;">&lt;-</span> sum((myfit$model$PatentsApp - mu)^2)  <span style="color: #795548;">## </span><span style="color: #795548;">RSS  residue sums of squares</span>
ss2 <span style="color: #0288D1;">&lt;-</span> rss/(NN) <span style="color: #795548;">## </span><span style="color: #795548;">Here we use the Population variance definition.</span>
ssdd <span style="color: #0288D1;">&lt;-</span> sqrt(ss2)

my.log.like <span style="color: #0288D1;">&lt;-</span> -NN/2 * log(2*pi) - NN*log(ssdd) - rss/(2*ss2)

p <span style="color: #0288D1;">&lt;-</span> 2 <span style="color: #795548;">## </span>

my.aic <span style="color: #0288D1;">&lt;-</span> -2*my.log.like + 2*(p+1)

summary(myfit)
print(c( AIC(myfit), my.aic))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">331.409410702845</td>
</tr>

<tr>
<td class="org-right">331.409410702845</td>
</tr>
</tbody>
</table>
</div>
</div>




<div id="outline-container-org39e87ce" class="outline-2">
<h2 id="org39e87ce">Forcing the intercept</h2>
<div class="outline-text-2" id="text-org39e87ce">
<p>
Hooke's law is a law of physics that states that the force \(F\) needed
to extend or compress a spring by some distance \(x\) scales linearly
with respect to that distance
</p>

\begin{equation}
F = kx, 
\end{equation}

<p>
where k is a constant
factor characteristic of the spring (i.e., its stiffness), and \(x\) is
small compared to the total possible deformation of the spring.
</p>

<p>
An experiment was draw and the following data was observed:
</p>

<div class="org-src-container">
<pre class="src src-R">
<span style="color: #388E3C;">my_plotLM</span>  <span style="color: #0288D1;">&lt;-</span> <span style="color: #bf360c;">function</span>(x, ... ){
    <span style="color: #bf360c;">if</span>(!class(x)<span style="color: #0288D1;">%in%</span><span style="color: #6C3082;">"lm"</span>) <span style="color: #bf360c;">stop</span>(<span style="color: #6C3082;">"We expect a linear model (lm) object"</span>)
plot(x$model[,2], x$model[,1], 
pch= 19, col=<span style="color: #6C3082;">"darkblue"</span>, ...,
main=paste(<span style="color: #6C3082;">"Points with fitted line"</span>, 
<span style="color: #6C3082;">"\n Y = ("</span>, round(x$coefficients[2],2), 
<span style="color: #6C3082;">") * X + "</span>, round(x$coefficients[1],2),
<span style="color: #6C3082;">"\n r^2 = "</span>, round(summary(x)$r.squared,3)))
<span style="color: #795548;">#</span><span style="color: #795548;">xlab ="zl per capita", ylab = "Patents applications")</span>
ifelse(length(x$coefficients = 1,
abline(0,x$coefficients, col=<span style="color: #6C3082;">"lightblue"</span>, lwd=3)
abline(x$coefficients, col=<span style="color: #6C3082;">"lightblue"</span>, lwd=3))
    }

<span style="color: #388E3C;">my_plotLM2</span>  <span style="color: #0288D1;">&lt;-</span> <span style="color: #bf360c;">function</span>(x, ... ){
    <span style="color: #bf360c;">if</span>(!class(x)<span style="color: #0288D1;">%in%</span><span style="color: #6C3082;">"lm"</span>) <span style="color: #bf360c;">stop</span>(<span style="color: #6C3082;">"We expect a linear model (lm) object"</span>)
plot(x$model[,2], x$model[,1], 
pch= 19, col=<span style="color: #6C3082;">"darkblue"</span>, ...,
main=paste(<span style="color: #6C3082;">"Points with fitted line"</span>, 
<span style="color: #6C3082;">"\n Y = ("</span>, round(x$coefficients[2],2), 
<span style="color: #6C3082;">") * X + "</span>, round(x$coefficients[1],2),
<span style="color: #6C3082;">"\n r^2 = "</span>, round(summary(x)$r.squared,3)))
<span style="color: #795548;">#</span><span style="color: #795548;">xlab ="zl per capita", ylab = "Patents applications")</span>
    matlines(x$model[,2],predict(x,int=<span style="color: #6C3082;">"c"</span>),
             col=c(<span style="color: #6C3082;">"light blue"</span>, <span style="color: #6C3082;">"grey"</span>, <span style="color: #6C3082;">"grey"</span>),
             lwd=c(2,2,2),
             lty=c(1,2,2))
    }

df  <span style="color: #0288D1;">&lt;-</span> data.frame(
    <span style="color: #6C3082;">"weight.gr"</span> = c(20,40,50,70,100,300,350,400,450,500),
    <span style="color: #6C3082;">"deformation"</span>= c(0.3 ,1 ,1.4 ,2.4 ,3.7 ,12.1 ,15.4 ,16.6 ,18.7 ,21))


myfit  <span style="color: #0288D1;">&lt;-</span> lm(deformation ~ weight.gr , data =df)
my_plotLM(myfit)

myfit2  <span style="color: #0288D1;">&lt;-</span> lm(deformation  ~ weight.gr + 0  , data =df) <span style="color: #795548;">## </span><span style="color: #795548;">forcing the intercept to be 0</span>
<span style="color: #795548;">## </span><span style="color: #795548;">myfit2.2  &lt;- lm(deformation ~ weight.gr -1  , data =df) ## forcing the intercept to be 0 different syntax that does the same (force intercept to be 0)</span>




my_plotLM2(myfit2)

<span style="color: #795548;">###  </span>
<span style="color: #795548;">###  </span><span style="color: #795548;">R^2 how it is computed when forcing the intercept to 0? </span>
<span style="color: #795548;">###  </span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf74e41c" class="outline-2">
<h2 id="orgf74e41c">Polynomial Regressions</h2>
<div class="outline-text-2" id="text-orgf74e41c">
<p>
The relationship between \(y\) and \(x\) often turns out not to be a straight
line.  how do we assess the significance of departures from linearity?
One of the simplest ways is to use polynomial regression.
</p>

<p>
We have just one continuous explanatory variable, \(x\), but we can fit
higher powers of \(x\), such as \(x^2\) and \(x^3\) , to the model in
addition to \(x\) to explain <b>curvature</b> in the relationship between y
and \(x\). It is useful to experiment with the kinds of curves that can be
generated with very simple models.
</p>



<div class="org-src-container">
<pre class="src src-R">
<span style="color: #795548;"># </span><span style="color: #795548;">source("my_Rtools.R")</span>

df <span style="color: #0288D1;">&lt;-</span> data.frame(
<span style="color: #6C3082;">"Year"</span> = c(
2000, 2001, 2002, 2003, 2004, 2005,
2006, 2007, 2008, 2009, 2010, 2011,
2012, 2013, 2014, 2015, 2016, 2017,
2018, 2019, 2020),
<span style="color: #6C3082;">"Expenditure"</span> = c(
125, 127, 118, 119, 135, 146,
155, 175, 202, 238, 270, 303,
372, 375, 420, 470, 467, 536,
668, 789, 845),
<span style="color: #6C3082;">"PatentsApp"</span> = c(
2404, 2202, 2313, 2268, 2381, 2028,
2157, 2392, 2488, 2883, 3203, 3880,
4415, 4237, 3939, 4676, 4261, 3942,
4207, 3887, 4010))


myfit1 <span style="color: #0288D1;">&lt;-</span> lm(PatentsApp ~ Expenditure, data= df)
myfit2 <span style="color: #0288D1;">&lt;-</span> lm(PatentsApp ~ Expenditure + I(Expenditure^2), data = df)
myfit3 <span style="color: #0288D1;">&lt;-</span> lm(PatentsApp ~ Expenditure + I(Expenditure^2) + I(Expenditure^3), data = df)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd069406" class="outline-2">
<h2 id="orgd069406">Using ANOVA to choose the best fitted model.</h2>
<div class="outline-text-2" id="text-orgd069406">
<p>
The ANOVA analysis performs an \(F\) test that is similar to the \(F\) test
for a linear regression. The difference is that this test is between
two models, whereas the regression \(F\) test is between using the
regression model and using no model.
</p>

<p>
We can use anova to compare them, and the result is a p-value which we
can compare. A small p-value indicates that the models are
significantly different.
</p>

<div class="org-src-container">
<pre class="src src-R">
anova(myfit1,myfit2)
anova(myfit2,myfit3)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc2e1a5f" class="outline-2">
<h2 id="orgc2e1a5f">Logarithmic Regressions</h2>
<div class="outline-text-2" id="text-orgc2e1a5f">
<p>
In this section we are insterested in models of the type
</p>

\begin{equation}
y = ae^{bx}
\end{equation}


<p>
As an example, these type of model appears in the decay of
organic material in soil, and our mechanistic model is based on the assumption that the fraction of dry matter
lost per year is a constant.
</p>

\begin{equation}
y = y_0 e^{-bt}
\end{equation}	

<p>
Here \(y_0\) is the initial dry mass (at time \(t = 0\)) and \(b\) is the decay rate (the parameter we want to estimate by
linear regression). Taking logs of both sides, we get
</p>

\begin{equation}
\ln(y) = \ln(y_0) - bt.
\end{equation}	

<p>
consider the following data:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">time</th>
<th scope="col" class="org-right">amount</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">125</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">100.2488583</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">70</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">83.47079531</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">100</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">65.90786956</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">66.53371457</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">53.58808673</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">61.33235104</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">43.92743547</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">40.29544843</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">44.71345876</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">32.53314287</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-right">36.64033626</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-right">40.15471123</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">23.08029549</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-right">39.86792844</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-right">22.84978589</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">35.01464535</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-right">17.97726709</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-right">21.1591801</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-right">27.99827279</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-right">21.88573499</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-right">14.27396172</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-right">13.66596918</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-right">11.81643542</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-right">25.18901636</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-right">8.195643809</td>
</tr>

<tr>
<td class="org-right">28</td>
<td class="org-right">17.19133663</td>
</tr>

<tr>
<td class="org-right">29</td>
<td class="org-right">24.28335424</td>
</tr>

<tr>
<td class="org-right">30</td>
<td class="org-right">17.72277625</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd4e40c9" class="outline-2">
<h2 id="orgd4e40c9">Power model</h2>
<div class="outline-text-2" id="text-orgd4e40c9">
<p>
Another related model is given by
</p>


\begin{equation}
y = ax^b,
\end{equation}

<p>
and when taking the logarithms we obtain
</p>

\begin{equation}
\ln(y) = \ln(a) + b\ln(x).
\end{equation}

<p>
Try to fit a linear model and exponential model to the following data set
</p>

<div class="org-src-container">
<pre class="src src-R">area <span style="color: #0288D1;">&lt;-</span>c(2.32155        , 2.525543, 2.627449, 2.195558, 1.088055, 2.044432, 1.79707     , 2.302335, 2.187373, 1.506705, 1.828855, 2.336525, 1.468181, 1.048413, 1.469381, 2.55183       , 1.618446, 1.543634, 1.707257, 1.854963, 2.59554       , 2.247533, 1.823993, 1.723572, 2.13321 , 1.586938, 1.073923, 1.193971, 1.932372, 1.089122)
response <span style="color: #0288D1;">&lt;-</span> c(2.367588, 2.881607, 2.641165, 2.592812, 2.15938   , 2.365786, 2.548956, 2.741471, 2.468152, 2.580795, 2.53684     , 2.41033       , 2.142693, 2.07412     , 2.517654, 2.833151, 2.377668, 2.409813, 2.227562, 2.49544     , 2.932836, 2.800229, 2.508883, 2.387154, 2.385757, 2.483149, 2.095175, 2.134681, 2.360977, 2.419167)

myfit1 <span style="color: #0288D1;">&lt;-</span> lm(response ~ area)
myfit2 <span style="color: #0288D1;">&lt;-</span> lm(log(response) ~ log(area))

plot(area,response, pch=19, col=<span style="color: #6C3082;">"blue"</span>, xlim=c(0,5),ylim =c(0,5))
xx <span style="color: #0288D1;">&lt;-</span> exp(myfit2$model[,2])
xx <span style="color: #0288D1;">&lt;-</span>xx[order(xx)]
abline(myfit1$coefficient,col=<span style="color: #6C3082;">"red"</span>)
lines(xx, exp(myfit2$coefficients[1])*(xx)^(myfit2$coefficients[2]), col=<span style="color: #6C3082;">"green"</span>)



plot(area,response, pch=19, col=<span style="color: #6C3082;">"blue"</span>, xlim=c(0,5),ylim =c(0,5))
abline(myfit1$coefficient,col=<span style="color: #6C3082;">"red"</span>)
<span style="color: #795548;"># </span><span style="color: #795548;">xx &lt;- exp(myfit2$model[,2])</span>
<span style="color: #795548;"># </span><span style="color: #795548;">xx &lt;-xx[order(xx)]</span>
xx <span style="color: #0288D1;">&lt;-</span> seq(0,5, by=0.1)
lines(xx, exp(myfit2$coefficients[1])*(xx)^(myfit2$coefficients[2]), col=<span style="color: #6C3082;">"green"</span>)
</pre>
</div>


<p>
The moral: you need to extremely careful when using regression models for prediction. If you
know that response must be zero when area is zero (the graph has to pass through the origin) then
obviously the power function is likely to be better for extrapolation to the left of the data. But if we have no
information on non-linearity other than that contained within the data, then parsimony suggests that errors
will be smaller using the simpler, linear model for prediction
</p>
</div>
</div>



<div id="outline-container-org3a70214" class="outline-2">
<h2 id="org3a70214">Multilinear Example</h2>
<div class="outline-text-2" id="text-org3a70214">
<p>
The homeprice dataset contains information about homes that sold in a town of New Jersey
in the year 2001. We wish to develop some rules of thumb in order to help us figure out what are
appropriate prices for homes. First, we need to explore the data a little bit.
</p>


<p>
We’ll begin with the regression on bedrooms and neighbourhood.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #0288D1;">library</span>(<span style="color: #6C3082;">"UseR"</span>)
summary(lm(sale ~ bedrooms + nbd))
</pre>
</div>


<p>
Next, we know that home buyers covet bathrooms. Hence, they should add value to a house. How
much?
</p>


<p>
This seems a little high, as the construction cost of a
new bathroom is less than this. Could it possibly be $5 thousand?
</p>

<p>
For the homeprice dataset, what does a half bathroom do for the sale price?
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Ballesteros Chávez.</p>
<p class="date">Created: 2023-01-04 Wed 10:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
